database_app/HelloService.wsdl

<wsdl:definitions name="HelloService"
   targetNamespace="http://www.examples.com/wsdl/HelloService.wsdl"
   xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
   xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
   xmlns:tns="http://www.examples.com/wsdl/HelloService.wsdl"
   xmlns:xsd="http://www.w3.org/2001/XMLSchema">

   <wsdl:message name="SayHelloRequest">
    <wsdl:part name="firstName" type="xsd:string"/>
   </wsdl:message>
   <wsdl:message name="SayHelloResponse">
    <wsdl:part name="greeting" type="xsd:string"/>
   </wsdl:message>

   <wsdl:portType name="Hello_PortType">
    <wsdl:operation name="sayHello">
       <wsdl:input message="tns:SayHelloRequest"/>
       <wsdl:output message="tns:SayHelloResponse"/>
    </wsdl:operation>
   </wsdl:portType>

   <wsdl:binding name="Hello_Binding" type="tns:Hello_PortType">
   <soap:binding style="rpc"
    transport="http://schemas.xmlsoap.org/soap/http"/>
   <wsdl:operation name="sayHello">
    <soap:operation soapAction="sayHello"/>
    <wsdl:input>
       <soap:body
        encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
        namespace="urn:examples:helloservice"
        use="encoded"/>
    </wsdl:input>
    <wsdl:output>
       <soap:body
        encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
        namespace="urn:examples:helloservice"
        use="encoded"/>
    </wsdl:output>
   </wsdl:operation>
   </wsdl:binding>

   <wsdl:service name="Hello_Service">
    <wsdl:documentation>WSDL File for HelloService</wsdl:documentation>
    <wsdl:port binding="tns:Hello_Binding" name="Hello_Port">
       <soap:address
        location="http://localhost:8000/wsdl"/>
    </wsdl:port>
   </wsdl:service>
</wsdl:definitions>
